#Область ПрограмныйИнтерфейс

Процедура ДополнитьФорму(Форма) Экспорт

	ИмяФормы = Форма.ИмяФормы;

	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаСправо(Форма);
		ВставитьПолеолеСогласованнаяCкидкаВГруппаШапкаЛево(Форма);
		ВставитьКомандуПересчитатьТаблицу(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		ВставитьПолеолеКонтактноеЛицоВГруппаШапкаСправо(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ВставитьПолеолеКонтактноеЛицоВГруппаШапкаСправо(Форма);
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаСправо(Форма);
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаСправо(Форма);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ДобавитьПолеКонтактноеЛицоВГруппаШапкаСправо(Форма)
	
	ПолеВвода = Форма.Элементы.Добавить("ДС_КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДС_КонтактноеЛицо";
	
КонецПроцедуры

Процедура ВставитьПолеолеКонтактноеЛицоВГруппаШапкаСправо(Форма)
	
	ПолеВвода = Форма.Элементы.Вставить("ДС_КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДС_КонтактныеЛица";
	
КонецПроцедуры
//  Алексеев М.Д.: Вывод поля  "ДС_СогласованнаяCкидка"
Процедура ВставитьПолеолеСогласованнаяCкидкаВГруппаШапкаЛево(Форма)
	
	Группа = Форма.Элементы.Вставить("ГруппаСкидка", Тип("ГруппаФормы"),Форма.Элементы.ГруппаШапкаЛево);
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	
	ПолеСогласованаяСкидка = Форма.Элементы.Вставить("ДС_СогласованнаяCкидка", Тип("ПолеФормы"), Форма.Элементы.ГруппаСкидка);
	ПолеСогласованаяСкидка.Вид = ВидПоляФормы.ПолеВвода;
	ПолеСогласованаяСкидка.ПутьКДанным = "Объект.ДС_СогласованнаяCкидка";
	 
	Форма.Элементы.ДС_СогласованнаяCкидка.УстановитьДействие("ПриИзменении", "ДС_СогласованнаяCкидкаПриИзменении");
	
КонецПроцедуры
//  Алексеев М.Д.: Вывод команды  "ПересчитатьТаблицу"
Процедура ВставитьКомандуПересчитатьТаблицу(Форма)
	
	Команда = Форма.Команды.Добавить("ПересчитатьТаблицу");
	Команда.Заголовок = "Пересчитать таблицу";
	Команда.Действие = "КомандаПересчитатьТаблицу";
	
	КнопкаФормы = Форма.Элементы.Вставить("ПересчитатьТаблицу", Тип("КнопкаФормы"), Форма.Элементы.ГруппаСкидка); 
	КнопкаФормы.ИмяКоманды = "ПересчитатьТаблицу";
	КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	КнопкаФормы.Картинка = БиблиотекаКартинок.Обновить;
	КнопкаФормы.Отображение  = ОтображениеКнопки.КартинкаИТекст;
	
КонецПроцедуры
#КонецОбласти 